{"config": [{"config": {"output_shape_type": "raw", "input_dtype": "float32", "trainable": true, "output_shape": [39, 160, 3], "arguments": {}, "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 39, 160, 3]}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "nb_col": 8, "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "subsample": [4, 4], "b_regularizer": null, "nb_row": 8, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "bias": true, "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "nb_col": 5, "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "bias": true, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "nb_col": 5, "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "bias": true, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "name": "dense_1", "output_dim": 512, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "name": "dense_2", "output_dim": 1, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}