{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-7080d6dc2af4>\u00da\b<lambda>\u0006\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "name": "lambda_2", "output_shape": [39, 160, 3], "output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 39, 160, 3], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 8, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "subsample": [4, 4], "nb_col": 8}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_6", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_3", "W_regularizer": null, "b_regularizer": null, "input_dim": null, "activation": "linear", "bias": true, "output_dim": 512, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_4", "W_regularizer": null, "b_regularizer": null, "input_dim": null, "activation": "linear", "bias": true, "output_dim": 1, "init": "glorot_uniform"}}], "keras_version": "1.1.2"}